---
kind: type
id: T:Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelOptions
source: html/65682466-07b4-766b-a215-fefcdcfd32ce.htm
---
# Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelOptions

Represents an object containing options for creating an AlignmentStationLabel .

## Syntax (C#)
```csharp
public class AlignmentStationLabelOptions
```